app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "companies" SET "name" = ?, "updated_at" = ? WHERE "companies"."id" = 1  [["name", "Judy and Judges"], ["updated_at", Sun, 11 May 2014 03:29:11 UTC +00:00]]
---
  def update
    company = Company.find(params[:id])
    company.update(company_params)