app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN (1, 2)
---
  def index
    @tasks = params[:ids] ? Task.find(params[:ids]) : Task.all